app/Http/Controllers/Api/BooksController.php

select * from `books` limit 10 offset 10
select `authors`.*, `author_book`.`book_id` as `pivot_book_id`, `author_book`.`author_id` as `pivot_author_id` from `authors` inner join `author_book` on `authors`.`id` = `author_book`.`author_id` where `author_book`.`book_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select `publishers`.*, `book_publisher`.`book_id` as `pivot_book_id`, `book_publisher`.`publisher_id` as `pivot_publisher_id` from `publishers` inner join `book_publisher` on `publishers`.`id` = `book_publisher`.`publisher_id` where `book_publisher`.`book_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select count(*) as aggregate from `books`
select `authors`.*, `author_book`.`book_id` as `pivot_book_id`, `author_book`.`author_id` as `pivot_author_id` from `authors` inner join `author_book` on `authors`.`id` = `author_book`.`author_id` where `author_book`.`book_id` in (11, 12, 13, 14, 15, 16, 17)
select `publishers`.*, `book_publisher`.`book_id` as `pivot_book_id`, `book_publisher`.`publisher_id` as `pivot_publisher_id` from `publishers` inner join `book_publisher` on `publishers`.`id` = `book_publisher`.`publisher_id` where `book_publisher`.`book_id` in (11, 12, 13, 14, 15, 16, 17)
select `authors`.*, `author_book`.`book_id` as `pivot_book_id`, `author_book`.`author_id` as `pivot_author_id` from `authors` inner join `author_book` on `authors`.`id` = `author_book`.`author_id` where `author_book`.`book_id` = 11 limit 1
select `publishers`.*, `book_publisher`.`book_id` as `pivot_book_id`, `book_publisher`.`publisher_id` as `pivot_publisher_id` from `publishers` inner join `book_publisher` on `publishers`.`id` = `book_publisher`.`publisher_id` where `book_publisher`.`book_id` = 11 limit 1
---
    public function index(BookIndexRequest $request)
    {
        $books = Book::with('authors', 'publishers')
            ->skip($request->start ?? 0)
            ->take($request->length ?? 10)
            ->get();

        $data = $books->map(function ($book) {
            return [
                'id'             => $book->id,
                'author_name'    => $book->authors->pluck('name')->flatten()->implode(', '),
                'name'           => $book->name,
                'publisher_name' => $book->publishers->pluck('name')->flatten()->implode(', '),
            ];
        });

        $response = [
            'draw'                 => intval($request->draw ?? 1),
            'iTotalDisplayRecords' => Book::count(),
            'data'                 => $data,
        ];

insert into `books` (`name`, `updated_at`, `created_at`) values ('Alo', '2022-11-11 06:33:38', '2022-11-11 06:33:38')
insert into `publishers` (`name`, `updated_at`, `created_at`) values ('publiser 1', '2022-11-10 17:28:03', '2022-11-10 17:28:03')
insert into `book_publisher` (`book_id`, `publisher_id`) values (52, '1'), (52, '49')
insert into `authors` (`name`, `updated_at`, `created_at`) values ('author 1', '2022-11-10 17:28:03', '2022-11-10 17:28:03')
insert into `book_publisher` (`book_id`, `publisher_id`) values (1, 2)
---
    public function store(BookStoreRequest $request)
    {
        $book = Book::create([
            'name' => $request->name,
        ]);

        $book->publishers()->attach($request->publishers);
        $book->authors()->attach($request->authors);

delete `publishers` from `publishers` inner join `book_publisher` on `publishers`.`id` = `book_publisher`.`publisher_id` where `book_publisher`.`book_id` = 2
delete from `books` where `id` = 2
delete `authors` from `authors` inner join `author_book` on `authors`.`id` = `author_book`.`author_id` where `author_book`.`book_id` = 2
delete from `book_publisher` where `book_publisher`.`book_id` = 1 and `book_publisher`.`publisher_id` in (1)
---
    public function update(BookUpdateRequest $request, Book $book)
    {
        $book->update([
            'name' => $request->name,
        ]);

        $book->publishers()->sync($request->publishers);
        $book->publishers()->sync($request->authors);

delete from `books` where `id` = 9
---
    public function destroy(Book $book)
    {
        $book->delete();